In [1]:
#%qtconsole #To open a seperate window running the Jupyter Qt Console which is running the same kernel
import pandas as pd
import platform
import numpy as np

In [2]:
file_name='Codevita_2k16_round1_scrapped.csv'
def return_file_path(base_url,file_name,file_seperator,intermediate_folder=''):
    if not intermediate_folder=='':
        intermediate_folder=intermediate_folder+file_seperator
    return '{}{}{}'.format(base_url,intermediate_folder,file_name)

if platform.system()=='Linux':
    base_url=r'/mnt/ECFC8291FC8255AC/Datasets/Codevita Results/'
    file_seperator='/'
else:
    file_seperator='\\'
    base_url='F:\\Datasets\\Codevita Results\\'
    
    

if platform.system()=='Linux':
    results_2k16_df=pd.read_csv(return_file_path(base_url,file_name,file_seperator))
else:
    results_2k16_df=pd.read_csv(return_file_path(base_url,file_name,file_seperator))

In [3]:
results_2k16_df.head()

,Unnamed: 0,college_name,ranks,tcs_region,team_name,user_name
0,0,"Kalyani Govt. Engg. College, WB",1,Kolkata,kgeccoders11,Soumik Sarkar & Subham Das
1,1,IIT ­ PATNA,2,Kolkata,CrazyDot,Gagan Kumar & Shifona Garg
2,2,Institute of Engg,3,Kolkata,RRecursion,Priyanjit Dey & Sayantan Basu
3,3,nit patna,4,Kolkata,knowsnoalgo,Ranjan Kumar & Abhishek Kumar
4,4,"Indian Institute Of Technology, Hyderabad",5,Hyderabad,voidcoders,Shubham Matta & Yash Pitroda

In [4]:
results_2k16_df=results_2k16_df.drop('Unnamed: 0',axis=1)

In [5]:
results_2k16_df.shape

(4150, 5)

In [6]:
results_2k16_df.describe()

             ranks
count  4150.000000
mean   2075.500000
std    1198.146137
min       1.000000
25%    1038.250000
50%    2075.500000
75%    3112.750000
max    4150.000000

In [7]:
results_2k16_df.head()

,college_name,ranks,tcs_region,team_name,user_name
0,"Kalyani Govt. Engg. College, WB",1,Kolkata,kgeccoders11,Soumik Sarkar & Subham Das
1,IIT ­ PATNA,2,Kolkata,CrazyDot,Gagan Kumar & Shifona Garg
2,Institute of Engg,3,Kolkata,RRecursion,Priyanjit Dey & Sayantan Basu
3,nit patna,4,Kolkata,knowsnoalgo,Ranjan Kumar & Abhishek Kumar
4,"Indian Institute Of Technology, Hyderabad",5,Hyderabad,voidcoders,Shubham Matta & Yash Pitroda

Trimming each string value to ensure there are no unnecessary whitespaces

In [8]:
results_2k16_df.college_name=results_2k16_df.college_name.str.strip()
results_2k16_df.tcs_region=results_2k16_df.tcs_region.str.strip()
results_2k16_df.team_name=results_2k16_df.team_name.str.strip()
results_2k16_df.user_name=results_2k16_df.user_name.str.strip()

Checking whether each entry of the users_name column has a '&'...if it has two entries, only then will the '&' be present otherwise it will not be present...if not present it will raise an assertion error

In [9]:
assert(sum(results_2k16_df.user_name.apply(lambda x:not '&' in x))==0)

In [10]:
results_2k16_df['user_1']=results_2k16_df.user_name.apply(lambda x:x.split(sep='&')[0].strip())
results_2k16_df['user_2']=results_2k16_df.user_name.apply(lambda x:x.split(sep='&')[1].strip())

Checking for any null entries in user_1 or user_2

In [11]:
assert(results_2k16_df.user_1[results_2k16_df.user_1==''].shape[0]==0)
assert(results_2k16_df.user_2[results_2k16_df.user_2==''].shape[0]==0)

Checking whether the column of tcs_regions contains any invalid entries

In [12]:
results_2k16_df.tcs_region.unique()

array(['Kolkata', 'Hyderabad', 'Pune', 'Ahmedabad', 'Trivandrum',
       'Lucknow', 'Mumbai', 'Delhi', 'National', 'DEENBANDHU', 'Chennai',
       'Bangalore', 'K.S.Institute', 'Madan', 'Birla', 'Walchand', 'Prof.',
       'JSS', 'Central', 'Zakir', 'PSG', 'Fr.', 'D.', 'Anil', 'Haldia',
       'Manakula', 'Bhilai', 'Bundelkhand', 'Indian', 'Techno', 'Meerut',
       'Shri', 'Institute', 'Thiagarajar', 'IIIT,', 'SRI', 'Punjab', 'Don',
       'RMK', 'Koneru', 'Gandhi', 'Army', 'B.M.S.', 'YMCA', 'Thadomal',
       'Bapuji', 'Gokaraju', 'Dr.', 'RGUKT', 'VIT', 'K.', 'Chitkara',
       'Arya', 'FACULTY', 'Other', 'Manav', 'NETAJI', 'Krishna', 'MAR',
       'Maharishi', 'Birsa', 'Coimbatore', 'SRM', 'CVR', 'J.', 'Cochin',
       'Kamaraj', 'Vardhaman', 'BITS', 'Meenakshi', 'JMIT',
       'K.RAMAKRISHNAN', 'Vel', 'Mahatma', 'Lovely', 'ABES', 'V.S.B.',
       'Sahyadri', 'RVR', 'Punjabi', 'Ganesh', 'Arunai', 'Rajalakshmi',
       'Malnad', 'KCG', 'MANAKULA', 'KLN', 'G', 'GNDU,', 'Biju',
       'Poornima', 'K.S.R', 'Rajiv', 'School', 'Amrita', 'Velammal',
       'GITAM', 'Kakatiya', 'Federal', 'Jaipur', 'Datta', 'NRI', 'VISHNU',
       'Gudlavalleru', 'Bharath', 'Ramrao', 'Dharamsinh', 'Jawaharlal',
       'Ajay', 'Valliammai', 'Dept', 'Vivekananda', 'V', 'SIDDHARTH',
       'vasireddy', 'TECHNOLOGY', 'Sri', 'VNR', 'institution', 'Chaitanya',
       'NBKR', 'Oriental', 'College', 'Ambedkar', 'Siddaganga', 'COE',
       'Gayatri', 'Karpagam', 'Sree', 'VELAMMAL', 'Pondicherry'], dtype=object)

We can see above that most probably due to errors induced during scraping the results of the website,a lot of erronous values got into the tcs_region column

On manual inspection, it was observed that for those *tcs_region* cells which contains erronous values, if we append the corresponding value of the *college_name* to that of the tcs_region, we get the actual name of the colleges 

Also, it was observed that many of the colleges are represented by more than 1 names in the *college_name* column...for eg. *'Srm Engineering College., Kattankulathur'* and *'SRM University'* are both same yet they are referred to by different times

To deal with this problem, let us first make a list of those college names which we know for a fact is a true region and not an erronous value...the easiest way for us to do this is by getting a frequency count of each of the entries in the tcs_region columns...the one which is a true region should have much more frequency count

In [13]:
results_2k16_df.tcs_region.value_counts()

Kolkata           686
Delhi             677
Hyderabad         634
Mumbai            605
Ahmedabad         349
Chennai           326
Lucknow           259
Pune              175
Trivandrum        160
Bangalore          54
Manakula           15
Indian              8
DEENBANDHU          7
V.S.B.              7
RMK                 5
Institute           5
RGUKT               5
National            4
Haldia              4
Meerut              4
K.RAMAKRISHNAN      4
Fr.                 4
Cochin              4
YMCA                4
SRI                 3
Krishna             3
Meenakshi           3
Dept                3
Army                3
Gandhi              3
                 ...
Ramrao              1
Gayatri             1
Birsa               1
Siddaganga          1
VISHNU              1
Vel                 1
Other               1
Karpagam            1
Arunai              1
Bundelkhand         1
VIT                 1
Lovely              1
Sahyadri            1
Dharamsinh          1
Ambedkar            1
College             1
JSS                 1
Gudlavalleru        1
Amrita              1
Sree                1
Punjabi             1
KCG                 1
SRM                 1
Dr.                 1
Bharath             1
K.S.Institute       1
Chitkara            1
Coimbatore          1
vasireddy           1
K.S.R               1
Name: tcs_region, dtype: int64

From above, it is clear that only the top 10 most frequently present values in the *tcs_region* column are actual regions while the others are erronous entries

In [14]:
true_tcs_regions_2k16=results_2k16_df.tcs_region.value_counts().iloc[0:10]
erronous_tcs_regions_2k16=results_2k16_df.tcs_region.value_counts().iloc[10:]

Now for the erronous entries, let's append the name of the colleges to the erronous entries in the *tcs_region* to create the modified college name

In [15]:
true_tcs_regions_index=true_tcs_regions_2k16.index
results_2k16_df['college_name_modified']=results_2k16_df.apply(lambda x:'{} {}'.format(x['tcs_region'],x['college_name']) if x['tcs_region'] not in true_tcs_regions_index else x['college_name'],axis=1)

In [16]:
results_2k16_df.head()

,college_name,ranks,tcs_region,team_name,user_name,user_1,user_2,college_name_modified
0,"Kalyani Govt. Engg. College, WB",1,Kolkata,kgeccoders11,Soumik Sarkar & Subham Das,Soumik Sarkar,Subham Das,"Kalyani Govt. Engg. College, WB"
1,IIT ­ PATNA,2,Kolkata,CrazyDot,Gagan Kumar & Shifona Garg,Gagan Kumar,Shifona Garg,IIT ­ PATNA
2,Institute of Engg,3,Kolkata,RRecursion,Priyanjit Dey & Sayantan Basu,Priyanjit Dey,Sayantan Basu,Institute of Engg
3,nit patna,4,Kolkata,knowsnoalgo,Ranjan Kumar & Abhishek Kumar,Ranjan Kumar,Abhishek Kumar,nit patna
4,"Indian Institute Of Technology, Hyderabad",5,Hyderabad,voidcoders,Shubham Matta & Yash Pitroda,Shubham Matta,Yash Pitroda,"Indian Institute Of Technology, Hyderabad"

Doing a quick check by checking the values of some of the erring examples

In [17]:
results_2k16_df[(results_2k16_df.tcs_region=='V.S.B.') | (results_2k16_df.tcs_region=='DEENBANDHU')]

,college_name,ranks,tcs_region,team_name,user_name,user_1,user_2,college_name_modified
26,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,27,DEENBANDHU,mysteriousgyz,Amit & Sushil Delhi,Amit,Sushil Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
223,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,224,DEENBANDHU,Bishops,Kanwardeep & Ravi Delhi,Kanwardeep,Ravi Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
573,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,574,DEENBANDHU,KS2041,Kapil Sharma & Shalu Delhi,Kapil Sharma,Shalu Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
1850,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,1851,DEENBANDHU,mirror,Tamanna & Pankaj Delhi,Tamanna,Pankaj Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
1865,"Engineering College, Karur",1866,V.S.B.,Janamani,Jana S & Manikandan Chennai,Jana S,Manikandan Chennai,"V.S.B. Engineering College, Karur"
1889,"Engineering College, Karur",1890,V.S.B.,Prabudinesh,Dinesh & Elamurugan Chennai,Dinesh,Elamurugan Chennai,"V.S.B. Engineering College, Karur"
2271,"Engineering College, Karur",2272,V.S.B.,PK Codebuiders,Karthick Periyasamy & Prem Chennai,Karthick Periyasamy,Prem Chennai,"V.S.B. Engineering College, Karur"
2288,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,2289,DEENBANDHU,ECE Coders,Vipul Goyal & Lovelesh Delhi,Vipul Goyal,Lovelesh Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
2295,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,2296,DEENBANDHU,Rogerdrunk,Sumit & Gaurav Delhi,Sumit,Gaurav Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
3407,"Engineering College, Karur",3408,V.S.B.,Deciphers,Monisa & Karthika Chennai,Monisa,Karthika Chennai,"V.S.B. Engineering College, Karur"
3770,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,3771,DEENBANDHU,rebellions,Ritvik Pandita & Tamanna Delhi,Ritvik Pandita,Tamanna Delhi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...
3974,"Engineering College, Karur",3975,V.S.B.,Twinkle,Raarthi Sramachandran & Aarthi Chennai,Raarthi Sramachandran,Aarthi Chennai,"V.S.B. Engineering College, Karur"
4037,"Engineering College, Karur",4038,V.S.B.,jaithi,Dhivya Rajendran & Jeyadurga Chennai,Dhivya Rajendran,Jeyadurga Chennai,"V.S.B. Engineering College, Karur"
4049,"Engineering College, Karur",4050,V.S.B.,Shock Circuiterz,Karthi Senthilvelan & Prasanth Chennai,Karthi Senthilvelan,Prasanth Chennai,"V.S.B. Engineering College, Karur"

Now, we observe that for those entries which have erronous values in the *tcs_region* section, we have the actual region as the last word in the user_name column and therefore the last name in the user_2 column

In [18]:
def correct_tcs_region_column(x):
    if not x['tcs_region'] in true_tcs_regions_2k16:
        true_region=x['user_2'].split()[-1:][0]
        assert(true_region in true_tcs_regions_2k16) #Assuring whether the extracted region is present in the list of true regions
        return true_region
    else:
        return x['tcs_region']

results_2k16_df['tcs_region_modified']=results_2k16_df.apply(correct_tcs_region_column,axis=1)

In [19]:
def correct_user2_column(x):
    if not x['tcs_region'] in true_tcs_regions_2k16:
        modified_username=' '.join(x['user_2'].split()[:-1])
        return modified_username
    else:
        return x['user_2']

results_2k16_df['user_2']=results_2k16_df.apply(correct_user2_column,axis=1)

In [20]:
results_2k16_df.head()

,college_name,ranks,tcs_region,team_name,user_name,user_1,user_2,college_name_modified,tcs_region_modified
0,"Kalyani Govt. Engg. College, WB",1,Kolkata,kgeccoders11,Soumik Sarkar & Subham Das,Soumik Sarkar,Subham Das,"Kalyani Govt. Engg. College, WB",Kolkata
1,IIT ­ PATNA,2,Kolkata,CrazyDot,Gagan Kumar & Shifona Garg,Gagan Kumar,Shifona Garg,IIT ­ PATNA,Kolkata
2,Institute of Engg,3,Kolkata,RRecursion,Priyanjit Dey & Sayantan Basu,Priyanjit Dey,Sayantan Basu,Institute of Engg,Kolkata
3,nit patna,4,Kolkata,knowsnoalgo,Ranjan Kumar & Abhishek Kumar,Ranjan Kumar,Abhishek Kumar,nit patna,Kolkata
4,"Indian Institute Of Technology, Hyderabad",5,Hyderabad,voidcoders,Shubham Matta & Yash Pitroda,Shubham Matta,Yash Pitroda,"Indian Institute Of Technology, Hyderabad",Hyderabad

In [21]:
results_2k16_df[(results_2k16_df.tcs_region=='V.S.B.') | (results_2k16_df.tcs_region=='DEENBANDHU')].head()

,college_name,ranks,tcs_region,team_name,user_name,user_1,user_2,college_name_modified,tcs_region_modified
26,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,27,DEENBANDHU,mysteriousgyz,Amit & Sushil Delhi,Amit,Sushil,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...,Delhi
223,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,224,DEENBANDHU,Bishops,Kanwardeep & Ravi Delhi,Kanwardeep,Ravi,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...,Delhi
573,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,574,DEENBANDHU,KS2041,Kapil Sharma & Shalu Delhi,Kapil Sharma,Shalu,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...,Delhi
1850,CHHOTU RAM UNIVERSITY OF SCIENCE AND TECHNOLOG...,1851,DEENBANDHU,mirror,Tamanna & Pankaj Delhi,Tamanna,Pankaj,DEENBANDHU CHHOTU RAM UNIVERSITY OF SCIENCE AN...,Delhi
1865,"Engineering College, Karur",1866,V.S.B.,Janamani,Jana S & Manikandan Chennai,Jana S,Manikandan,"V.S.B. Engineering College, Karur",Chennai

In [22]:
results_2k16_df.tcs_region_modified.value_counts()

Delhi         728
Kolkata       710
Hyderabad     678
Mumbai        620
Chennai       387
Ahmedabad     350
Lucknow       265
Pune          180
Trivandrum    171
Bangalore      61
Name: tcs_region_modified, dtype: int64

We had seen while preprocessing the 2k15 results that many colleges have the name of the department attached before them...all of those start with the word 'Dept'

In [23]:
print(results_2k16_df.college_name_modified.count())
results_2k16_df.college_name_modified.dropna().count()

4135

4135

In [24]:
results_2k16_df.team_name[results_2k16_df.team_name=='']

Series([], Name: team_name, dtype: object)

In [25]:
college_db=pd.read_csv(return_file_path(base_url,'college_list.csv',file_seperator,'generated_preprocessing'))

In [26]:
college_db.head()

   Unnamed: 0                                       college_name tcs_region
0           0           Srm Engineering College., Kattankulathur    Chennai
1           1  Army Institute of Technology,Pune University, ...       Pune
2           2                      Osmania University, Hyderabad  Hyderabad
3           3         Medicaps Inst of Tech & Management, Indore     Mumbai
4           4          Ramrao Adik Institute of Technology,Nerul     Mumbai

In [27]:
college_db=college_db.drop('Unnamed: 0',axis=1)

In [28]:
college_db.head()

                                        college_name tcs_region
0           Srm Engineering College., Kattankulathur    Chennai
1  Army Institute of Technology,Pune University, ...       Pune
2                      Osmania University, Hyderabad  Hyderabad
3         Medicaps Inst of Tech & Management, Indore     Mumbai
4          Ramrao Adik Institute of Technology,Nerul     Mumbai

In [29]:
college_db.shape

(548, 2)

In [30]:
len(results_2k16_df.college_name_modified.unique())

685

Checking whether the regions of 2k15 and 2k16 are the same or not

In [31]:
pd.Series(results_2k16_df.tcs_region_modified.unique()).isin(college_db.tcs_region.unique())

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
dtype: bool

In [32]:
results_2k16_df.head()

,college_name,ranks,tcs_region,team_name,user_name,user_1,user_2,college_name_modified,tcs_region_modified
0,"Kalyani Govt. Engg. College, WB",1,Kolkata,kgeccoders11,Soumik Sarkar & Subham Das,Soumik Sarkar,Subham Das,"Kalyani Govt. Engg. College, WB",Kolkata
1,IIT ­ PATNA,2,Kolkata,CrazyDot,Gagan Kumar & Shifona Garg,Gagan Kumar,Shifona Garg,IIT ­ PATNA,Kolkata
2,Institute of Engg,3,Kolkata,RRecursion,Priyanjit Dey & Sayantan Basu,Priyanjit Dey,Sayantan Basu,Institute of Engg,Kolkata
3,nit patna,4,Kolkata,knowsnoalgo,Ranjan Kumar & Abhishek Kumar,Ranjan Kumar,Abhishek Kumar,nit patna,Kolkata
4,"Indian Institute Of Technology, Hyderabad",5,Hyderabad,voidcoders,Shubham Matta & Yash Pitroda,Shubham Matta,Yash Pitroda,"Indian Institute Of Technology, Hyderabad",Hyderabad

In [33]:
college_db_2k16=pd.DataFrame(results_2k16_df,columns=['college_name','college_name_modified','tcs_region','tcs_region_modified'])

Since we are creating a db of the colleges present in the 2k16 results, we need to remove all the duplicate entries present in the *college_name_modified* column

In [34]:
college_db_2k16=college_db_2k16.ix[college_db_2k16.college_name_modified.drop_duplicates().index]

In [35]:
college_db_2k16.to_csv(return_file_path(base_url,'college_list_2k16.csv',file_seperator,'generated_preprocessing'))

In [36]:
results_2k16_df.to_csv(return_file_path(base_url,'results_2k16_preprocessed.csv',file_seperator,'generated_preprocessing'),index=False)